---
kind: type
id: T:Autodesk.Revit.DB.Architecture.ContinuousRailType
source: html/0f4641e3-74e0-0a8e-eb56-fb6f9904b173.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType

A type element containing the properties of a continuous rail.

## Syntax (C#)
```csharp
public class ContinuousRailType : ElementType
```